// *****************************************
// 參照運算式應用程式
// *****************************************
open System

// *****************************************
// 建立一個參照儲存格變數
// *****************************************
let refObj = ref 1200.50

// *****************************************
// 將參照儲存格變數之值
// 使用對應轉換為指定型態資料顯示
// *****************************************
Console.WriteLine(!refObj)
refObj := 1000.60
Console.WriteLine(!refObj)

// *****************************************
// 將參照儲存格變數之值
// 使用對應轉換為指定型態資料取出，再執行運算
// *****************************************
refObj := !refObj + 1000.25
Console.WriteLine(!refObj)
Console.WriteLine(Console.ReadLine())